<template>
<p class=gua>{{ guaOriginal }}</p>
</template>

<script>
export default {
  name: 'CalendarAside',
  props: {
    day: Number,
  },
  computed: {
    septimalDate() {
      return (35 + this.day) % 49
    },
    guaOriginal() {
      const guaOriginals = [
        '第廿四卦\u3000火\u3000化\n下火上火\u3000纯同卦\n对偶卦：水\n对手卦：火\n对立卦：水\n卦辞：椒乎？椒也，椒也，帝也！\n原文：什么是胡椒啊？胡椒，胡椒……拿破仑！',
        '第卌一卦\u3000祭祀\u3000示\n下木上火\u3000客制卦\n对偶卦：雾气\n对手卦：欲望\n对立卦：变幻\n同仇卦：忍耐、新生\n同食卦：对抗、重生\n卦辞：丧目于禴，不如从而为牺牲，实无攸利。有悔，贞厉。\n原文：我从一开始就不应该苟活。如果我不苟活下去，我的眼睛就不会死。\n第四先萃注：一个人面临厄运时，为了能够换取苟活，答应了神牺牲自己的双眼，也代表对世上的不公视而不见。后来，他宁愿自己当时没有活下去。',
        '第十卦\u3000对手\u3000雠\n下光上火\u3000客胜卦\n对偶卦：小人\n对手卦：自我\n对立卦：同伴\n同仇卦：超越、倾听\n同食卦：忍耐、经典\n卦辞：彼其先，其死。\n原文：要么你先我而去，要么你死在我身边。',
        '第卅卦\u3000成败\u3000得\n下土上火\u3000主劫卦\n对偶卦：梦幻\n对手卦：忍耐\n对立卦：思考\n同仇卦：欲望、腐朽\n同食卦：自我、绝笔\n卦辞：王霸之行，得失胜负。\n原文：反正这个世界是掠夺者的游戏，要么赢，要么输。',
        '第廿八卦\u3000反叛\u3000忤\n下风上火\u3000客劫卦\n对偶卦：重生\n对手卦：恶魔\n对立卦：绽放\n同仇卦：对抗、雾气\n同食卦：超越、神\n卦辞：问苦曰无，求归得去。\n原文：「世界上最痛苦的是什么呢？」「没有。」「我也觉得。」「我们私奔吧。」「好的。」',
        '第卌三卦\u3000救赎\u3000质\n下水上火\u3000主胜卦\n对偶卦：救赎\n对手卦：对抗\n对立卦：对抗\n同仇卦：恶魔、变幻\n同食卦：欲望、绽放\n卦辞：尽质。\n原文：没有什么是不能被放弃的。',
        '第卌九卦\u3000爆发\u3000迸\n下空上火\u3000主制卦\n对偶卦：朦胧\n对手卦：超越\n对立卦：隐退\n同仇卦：自我、表达\n同食卦：恶魔、时间\n卦辞：君子不安死，明耀乾坤。小人勿用。\n原文：要么成为坟墓，要么点亮世界。\n第二先萃注：「点亮」原文为「炸点」，因为过于负能量且不知所云而作了一点修改。\n',
        '第卌四卦\u3000欲望\u3000憙\n下火上木\u3000主制卦\n对偶卦：变幻\n对手卦：祭祀\n对立卦：雾气\n同仇卦：腐朽、成败\n同食卦：绽放、救赎\n卦辞：效哲，反以无食。\n原文：柏拉图可以如此生活，你也值得。但是，我饿。',
        '第廿三卦\u3000木\u3000冒\n下木上木\u3000纯同卦\n对偶卦：风\n对手卦：木\n对立卦：风\n卦辞：结离，离结，荣。\n原文：结了离，离了结，不断补充营养。\n第二先萃注：「结」和「离」并不是字面意思上的结婚和离婚，而是代指生物的螺旋式生长，一岁一枯荣，春夏繁茂秋冬凋零，正如大树和叶子结合了又分开，分开了又结合。',
        '第十五卦\u3000创造\u3000建\n下光上木\u3000客制卦\n对偶卦：孤独\n对手卦：寻找\n对立卦：泥土\n同仇卦：盛开、革新\n同食卦：生命、倾听\n卦辞：复新然，知天地不仁。\n原文：一次次的开幕，而主导者聪而不明。',
        '第三卦\u3000新生\u3000萌\n下土上木\u3000客胜卦\n对偶卦：革新\n对手卦：腐朽\n对立卦：理解\n同仇卦：祭祀、忍耐\n同食卦：盛开、孤独\n卦辞：蔽兔怀卵如，雉子其怀，灵宝其旁。\n原文：这傻兔子竟然抱着一个蛋。就是抱着一个鸡蛋，旁边是梦想的钻石。\n第四先萃注：四季交替，又到了一年的春天。象征着新生与希望的兔子抱着彩蛋,对新的一季充满着期待与祝福。梦想的钻石在此刻的映衬下都失去了原有的光辉。',
        '第卅七卦\u3000凋谢\u3000零\n下风上木\u3000主劫卦\n对偶卦：凋谢\n对手卦：盛开\n对立卦：盛开\n同仇卦：寻找、理解\n同食卦：腐朽、泥土\n卦辞：多孤怆，凶。\n原文：更多的怆痛和必然的孤寂。',
        '第卅四卦\u3000重生\u3000复\n下水上木\u3000客劫卦\n对偶卦：反叛\n对手卦：绽放\n对立卦：恶魔\n同仇卦：生命、隐退\n同食卦：祭祀、对抗\n卦辞：或损之元亨利贞，弗利既往。苏无实，无咎。\n原文：一个人要怎么样，才可能失去元亨利贞，并同时杀死过去的自己？那些都只是一种感觉。',
        '第卅九卦\u3000弥散\u3000弭\n下空上木\u3000主胜卦\n对偶卦：时间\n对手卦：生命\n对立卦：神\n同仇卦：绽放、朦胧\n同食卦：寻找、表达\n卦辞：上上乾行，利有攸往。\n原文：每一个天空都有你们追梦的痕迹。',
        '第八卦\u3000自我\u3000己\n下火上光\u3000主胜卦\n对偶卦：同伴\n对手卦：对手\n对立卦：小人\n同仇卦：表达、爆发\n同食卦：绝笔、成败\n卦辞：俯仰，凭高悟己。\n原文：仰慕者，旁观者，还有很多追随者。人在高处不胜寒，一定要相信自己。',
        '第四卦\u3000寻找\u3000索\n下木上光\u3000主制卦\n对偶卦：泥土\n对手卦：创造\n对立卦：孤独\n同仇卦：理解、凋谢\n同食卦：表达、弥散\n卦辞：彼尔何之？昭昭不落，彰彰众仰。\n原文：因为我不知道你在哪里，只有日不落的东西，才可能在每一个人的上空出现。',
        '第廿六卦\u3000存在\u3000是\n下光上光\u3000纯同卦\n对偶卦：地\n对手卦：存在\n对立卦：地\n卦辞：是光是尘，惟是人也。安。\n原文：一个人骄傲一定有其骄傲的理由，一个人卑微也有其卑微的理由。每个人都是独立的，早安！',
        '第十七卦\u3000经典\u3000典\n下土上光\u3000客制卦\n对偶卦：经典\n对手卦：绝笔\n对立卦：绝笔\n同仇卦：思考、小人\n同食卦：对手、忍耐\n卦辞：证以年，论以岁，言以事。\n原文：让时光见证，让岁月发声，让事实说话。',
        '第十六卦\u3000革新\u3000庚\n下风上光\u3000客胜卦\n对偶卦：新生\n对手卦：理解\n对立卦：腐朽\n同仇卦：创造、盛开\n同食卦：思考、雾气\n卦辞：王假有冠，弗用后年之家。震出于中。\n原文：这个世界并不是，你以为你拿了第一，就可以安享晚年。而这正是打雷的意义。',
        '第卅一卦\u3000梦幻\u3000惑\n下水上光\u3000主劫卦\n对偶卦：成败\n对手卦：思考\n对立卦：忍耐\n同仇卦：绝笔、同伴\n同食卦：理解、变幻\n卦辞：惑见不述，复惑以幻。得天目，悔亡。\n原文：生命中有很多不可言说的东西，你看到过，却无法表达。而且时过境迁，竟觉得如此的不真实，就像一个又一个的幻觉。但毕竟也毫无证据，而这正是有监控等设备的好处。',
        '第七卦\u3000倾听\u3000识\n下空上光\u3000客劫卦\n对偶卦：破碎\n对手卦：表达\n对立卦：永恒\n同仇卦：对手、超越\n同食卦：创造、生命\n卦辞：人异而不斥党，东南得朋。\n原文：并且我坚信各人有各人的风格，但是我不排斥和人同款，那代表一种相互直觉上的文明认同。',
        '第卌八卦\u3000忍耐\u3000茹\n下火上土\u3000客劫卦\n对偶卦：思考\n对手卦：成败\n对立卦：梦幻\n同仇卦：新生、祭祀\n同食卦：经典、对手\n卦辞：茹塞，待之勿恤，妄动则厉。\n原文：要耐得住寂寞，扛得住迷惑，等待是最长情的告白。忍不了一时，就用于出头之日。\n第二先萃注：「用于」应为「永无」，输入法谬误。',
        '第二卦\u3000腐朽\u3000隳\n下木上土\u3000主胜卦\n对偶卦：理解\n对手卦：新生\n对立卦：革新\n同仇卦：成败、欲望\n同食卦：泥土、凋谢\n卦辞：小眚，终厉。\n原文：很多年的伏笔，换来了今天的恶性肿瘤。\n第二先萃注：「恶性肿瘤」为引申义，指多年积累的症结。',
        '第卅二卦\u3000绝笔\u3000遗\n下光上土\u3000主制卦\n对偶卦：绝笔\n对手卦：经典\n对立卦：经典\n同仇卦：同伴、梦幻\n同食卦：成败、自我\n卦辞：绝遗。其损有遗，君子为用。\n原文：因为我死以后，我也不会知道你是如何。但是我知道这些创造出来的东西，可能带给生命温暖，抵御寒冷和悲伤。',
        '第廿五卦\u3000地\u3000阵\n下土上土\u3000纯同卦\n对偶卦：存在\n对手卦：地\n对立卦：存在\n卦辞：有司，七日之樱，无誉无咎。\n原文：每个人只不过在各自的职位上各司其职罢了，樱花七日，重复如此。',
        '第卌七卦\u3000孤独\u3000茕\n下风上土\u3000客制卦\n对偶卦：创造\n对手卦：泥土\n对立卦：寻找\n同仇卦：破碎、神\n同食卦：新生、盛开\n卦辞：弗往弗来，恒安，无咎。\n原文：你不来，我不去，站成永恒。恰如其分，又各自安好。',
        '第十一卦\u3000小人\u3000佞\n下水上土\u3000客胜卦\n对偶卦：对手\n对手卦：同伴\n对立卦：自我\n同仇卦：经典、思考\n同食卦：破碎、隐退\n卦辞：佞或在阴，不知何为，无所语及。\n原文：只知道的是有人躲在暗处，而他们的行为无人看到，也无人说起。',
        '第十八卦\u3000永恒\u3000恒\n下空上土\u3000主劫卦\n对偶卦：表达\n对手卦：破碎\n对立卦：倾听\n同仇卦：泥土、时间\n同食卦：同伴、朦胧\n卦辞：恒如存如，永贞吉。\n原文：你知道什么是永恒吗？就是无论时间流失，岁月如何更替，风水如何轮流，时局如何更改，都不会失效的东西。',
        '第卌二卦\u3000恶魔\u3000聻\n下火上风\u3000主劫卦\n对偶卦：绽放\n对手卦：反叛\n对立卦：重生\n同仇卦：变幻、救赎\n同食卦：时间、爆发\n卦辞：恒如死如，明见聪闻；不耽而啕，尔嗟我怨，至于十岁不改。万象妄存。\n原文：他号称永远存在，也可能已经死了，如果你们能明白，你们就会知道我说的是什么。而我也与爱失去连接。他不喜欢他的家，我也不喜欢我的家。而这正是狗改不了吃屎的习惯，让这个世界的存在可能并没有意义。',
        '第卅六卦\u3000盛开\u3000华\n下木上风\u3000客劫卦\n对偶卦：盛开\n对手卦：凋谢\n对立卦：凋谢\n同仇卦：革新、创造\n同食卦：孤独、新生\n卦辞：裕之逼之，悠之即之；随日归妹不如占日归妹，恒而有章。或益万乘之国，永贞吉。\n原文：什么是豁达，什么是狭隘；一辈子很长，一辈子很短。结婚不如择婚，出生不如选彩。两个人长长久久一辈子，不离不弃不分家，这才是最好的盛世。你敢宣誓，生命的确非常重要吗？',
        '第五卦\u3000理解\u3000喻\n下光上风\u3000主胜卦\n对偶卦：腐朽\n对手卦：革新\n对立卦：新生\n同仇卦：凋谢、寻找\n同食卦：变幻、梦幻\n卦辞：琴奏在阳，有风和之，天喻好德，吾与尔共鸣之。\n原文：和声和伴奏或者主旋律和背景音乐之间，究竟是什么让它们在数分钟的演奏中，持续产生出共鸣。',
        '第卅八卦\u3000泥土\u3000后\n下土上风\u3000主制卦\n对偶卦：寻找\n对手卦：孤独\n对立卦：创造\n同仇卦：时间、永恒\n同食卦：凋谢、腐朽\n卦辞：君子求全，弗用旧裳。\n原文：很多事情，一定要尽可能的尽善尽美。有些过去的事情，自己也需要忘记。\n第四先萃注：第一个分句解释了为什么要忘记，就是为了表面的善和美牺牲自己的情感，忘记痛苦的记忆，和谐地继续下去。',
        '第廿一卦\u3000风\u3000使\n下风上风\u3000纯同卦\n对偶卦：木\n对手卦：风\n对立卦：木\n卦辞：西南丧朋，征凶，不利涉大川。\n原文：直到最后，自己仍然是「少数派」。那么便知道，人生还是无法进入顺势而为的洪流。',
        '第卌六卦\u3000雾气\u3000漠\n下水上风\u3000客制卦\n对偶卦：祭祀\n对手卦：变幻\n对立卦：欲望\n同仇卦：反叛、对抗\n同食卦：革新、思考\n卦辞：言在空尘，所以隐介于是。\n原文：你说的每句话，都在空气泥土以及自然里，而这就是你们可以藏起来并且根本就不会被注意到的自由意义。\n第三先萃注：空气为雾的形态，泥土为雾形成需要的凝结核，自然为雾形成依赖的自然规律。\n第七先萃注：阴阳夹岸，夏冬暖热，雾气同浩渺，迎日而开，秦有人受始皇旨意，出文登而寻蓬莱，远处有一山，山市千灯照碧云，山外化海，唯露一岛，岛外看波涛同雾，下方舟船往来却不见一人，终迷于雾气之中，再见陆地，为邪马台国。',
        '第卌卦\u3000神\u3000引\n下空上风\u3000客胜卦\n对偶卦：生命\n对手卦：时间\n对立卦：弥散\n同仇卦：孤独、破碎\n同食卦：反叛、超越\n卦辞：无昔，无在，无往，匪人故傲。\n原文：过去没有你，现在也不会有你，未来也没有。因为你们甚至都没有人的感情，并以此为傲。',
        '第廿九卦\u3000对抗\u3000搏\n下火上水\u3000客胜卦\n对偶卦：对抗\n对手卦：救赎\n对立卦：救赎\n同仇卦：雾气、反叛\n同食卦：重生、祭祀\n卦辞：二夫往来，无为无咎。知所不可而不触。战以无北，凶。\n原文：你有你的阳关道，我们也有我们的阳关道。你别来就可以，各人有各人的生活。你也知道，背水一战或者异乡作战代表什么。',
        '第卅五卦\u3000绽放\u3000丰\n下木上水\u3000主劫卦\n对偶卦：恶魔\n对手卦：重生\n对立卦：反叛\n同仇卦：朦胧、弥散\n同食卦：救赎、欲望\n卦辞：明博广，若有丰，无不利。\n原文：明媚，博大，宽广，无限精彩。等着你们，还有我们所有人。年轻意味着什么？年轻意味着没有不可能。',
        '第廿七卦\u3000思考\u3000虑\n下光上水\u3000客劫卦\n对偶卦：忍耐\n对手卦：梦幻\n对立卦：成败\n同仇卦：小人、经典\n同食卦：雾气、革新\n卦辞：虑复日，典尽。\n原文：又过了一天，一天又一天，偷走一本书的时间。',
        '第九卦\u3000同伴\u3000俦\n下土上水\u3000主胜卦\n对偶卦：自我\n对手卦：小人\n对立卦：对手\n同仇卦：梦幻、绝笔\n同食卦：朦胧、永恒\n卦辞：同信，同眠；同榻，同难。\n原文：互相信任，相拥而眠，同床共枕，患难与共。',
        '第廿卦\u3000变幻\u3000玄\n下风上水\u3000主制卦\n对偶卦：欲望\n对手卦：雾气\n对立卦：祭祀\n同仇卦：救赎、恶魔\n同食卦：梦幻、理解\n卦辞：风雪不待，无攸利。\n原文：风花雪花不敢等人。',
        '第廿二卦\u3000水\u3000准\n下水上水\u3000纯同卦\n对偶卦：火\n对手卦：水\n对立卦：火\n卦辞：准幽，知之晦。\n原文：藏进一个人的梦里，看清，黑暗。',
        '第卅三卦\u3000隐退\u3000亥\n下空上水\u3000客制卦\n对偶卦：超越\n对手卦：朦胧\n对立卦：爆发\n同仇卦：重生、生命\n同食卦：小人、破碎\n卦辞：亥子三易，匪阳无明。有孚不溯，从流，吉。\n原文：这个世界更新换代是很快的，你目前没有能力站住脚跟。想要不被这人流的洪荒所冲开，不如认清形势放弃幻想。',
        '第十四卦\u3000超越\u3000益\n下火上空\u3000客制卦\n对偶卦：隐退\n对手卦：爆发\n对立卦：朦胧\n同仇卦：倾听、对手\n同食卦：神、反叛\n卦辞：生于惑幕，自薄损之。天外有人。\n原文：原来是，人家活在荧幕里，所以都很自卑。天外有天，人外有人。',
        '第十三卦\u3000生命\u3000命\n下木上空\u3000客胜卦\n对偶卦：神\n对手卦：弥散\n对立卦：时间\n同仇卦：隐退、重生\n同食卦：倾听、创造\n卦辞：生，死；存，亡。\n原文：从出生到死亡，每一天都在生存和毁灭中挣扎。',
        '第六卦\u3000表达\u3000诉\n下光上空\u3000主劫卦\n对偶卦：永恒\n对手卦：倾听\n对立卦：破碎\n同仇卦：爆发、自我\n同食卦：弥散、寻找\n卦辞：请诉以类，雅言明义。\n原文：如果你要表达，请注明你的派别，尽量使用正规列举风格，最好注明推理过程。',
        '第十九卦\u3000破碎\u3000靡\n下土上空\u3000客劫卦\n对偶卦：倾听\n对手卦：永恒\n对立卦：表达\n同仇卦：神、孤独\n同食卦：隐退、小人\n卦辞：昭昭其落，有容于旧馆；陛宇戚戚，不如征桨渺渺。得哂，厉。\n原文：大英帝国在倒塌。可是大英博物馆里还有你的肖像，却说不出什么是大笨钟的悲伤，以至于大不列颠的船只偏向地中海的刹那，我感觉到了后殖民的笑话。',
        '第十二卦\u3000时间\u3000宙\n下风上空\u3000主胜卦\n对偶卦：弥散\n对手卦：神\n对立卦：生命\n同仇卦：永恒、泥土\n同食卦：爆发、恶魔\n卦辞：弗继续之，征吉。\n原文：从来就没有继续，只是向前。',
        '第卌五卦\u3000朦胧\u3000冥\n下水上空\u3000主制卦\n对偶卦：爆发\n对手卦：隐退\n对立卦：超越\n同仇卦：弥散、绽放\n同食卦：永恒、同伴\n卦辞：不知不晓，或是或非，或有或无。\n原文：不知道，没看到，有可能，也不太可能，或者是，或者不是。',
        '第一卦\u3000自然\u3000有\n下空上空\u3000纯同卦\n对偶卦：自然\n对手卦：自然\n对立卦：自然\n卦辞：有命其然，无咎。\n原文：人各有命，都是生活中常见的事情罢了，并没有什么新鲜的。',
      ]
      return guaOriginals[this.septimalDate]
    }
  }
}
</script>

<style>
.gua { white-space: pre-line; }
</style>
